/// @file console.h
/// @brief Работа с консолью вне зависимости от аппаратной реализации. Также 
/// другие безопасные функции работы со строками.
/// 
/// @author  Иванюк Дмитрий Сергеевич.
///
/// @par Описание директив препроцессора:
/// @c DEBUG    - компиляция c выводом отладочной информации в консоль.@n@n
/// 
/// @par Текущая версия:
/// @$Rev: 220 $.\n
/// @$Author: id $.\n
/// @$Date:: 2011-02-15 16:58:56#$.

#ifndef CONSOLE_H
#define CONSOLE_H

#if !defined WIN_OS
#error You must define OS!
#endif // !defined WIN_OS

#include <string.h>
#include <stdio.h>

#include "types.h"

/// @brief Проверка нажатия клавиши.
#define Print  

#ifdef WIN_OS
#include "w_console.h"
#endif // WIN_OS
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
/// @brief Проверка нажатия клавиши.
///
/// @return 0 - нет нажатий клавиш.
/// @return 1 - нажата клавиша.
int  kb_hit();
//-----------------------------------------------------------------------------
/// @brief Считывание нажатого символа с консоли.
///
/// @return - символ нажатой клавиши.
int  get_char();
//-----------------------------------------------------------------------------
/// @brief Вывод числа в консоль в двоичном виде.
///
/// @param с - выводимое число.
void print_binary( unsigned int c );
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

#endif // CONSOLE_H
