/// @file led.h
/// @brief Работа со светодиодным индикатором.
///
/// @author  Иванюк Дмитрий Сергеевич.
///
/// @par Описание директив препроцессора:
///
/// @par Текущая версия:
/// @$Rev: 220 $.\n
/// @$Author: id $.\n
/// @$Date:: 2011-02-15 16:58:56#$.

#ifndef LED_H
#define LED_H

//-----------------------------------------------------------------------------
/// @brief Работа с диодными индикаторами. Представляет абстракцию от
/// физической реализации таковых.
class led
    {
    public:
        enum COLOUR
            {
            C_GREEN = 1,
            C_YELLOW,
            C_RED
            };

        enum LEDS_NAMES
            {
            L_ALL = 1,
            L_STATUS,
            L_SERVICE,
            L_USER
            };

        /// @brief Включение диодного индикатора.
        ///
        /// @param led       - диод.
        /// @param led_color - цвет.
        virtual void on( LEDS_NAMES led, COLOUR led_color ) = 0;

        /// @brief Выключение диодного индикатора.
        virtual void off( LEDS_NAMES led ) = 0;

        virtual ~led()
            {
            }
    };
//-----------------------------------------------------------------------------
led* get_led();
//-----------------------------------------------------------------------------
#endif // LED_H
