/// @file sys_w750.h
/// @brief Содержит описания классов, которые реализуют аппаратную часть 
/// PAC WAGO 750.
/// 
/// @author  Иванюк Дмитрий Сергеевич.
///
/// @par Описание директив препроцессора:
/// 
/// @par Текущая версия:
/// @$Rev: 65 $.\n
/// @$Author: id@BMK $.\n
/// @$Date:: 2010-05-06 12:38:39#$.

#ifndef SYS_7186_H
#define SYS_7186_H

#include "sys_linux.h"
//-----------------------------------------------------------------------------
/// @brief Работа с энергонезависимой ОЗУ. Представляет абстракцию от 
/// физического распределения памяти.
class NV_memory_manager_PC: public NV_memory_manager
    {    
    public:
        NV_memory_manager_PC();       
    };
//-----------------------------------------------------------------------------
#endif // SYS_7186_H
