/// @file l_console.h
/// @brief Работа с консолью в ОС Linux. Также другие безопасные функции
/// работы со строками.
///
/// @author  Иванюк Дмитрий Сергеевич.
///
/// @par Описание директив препроцессора:
/// @c DEBUG    - компиляция c выводом отладочной информации в консоль.@n@n
///
/// @par Текущая версия:
/// @$Rev: 220 $.\n
/// @$Author: id $.\n
/// @$Date:: 2011-02-15 16:58:56#$.

#ifndef L_CONSOLE_H
#define L_CONSOLE_H

#include <time.h>
//-----------------------------------------------------------------------------
#ifdef DEBUG
#undef Print
#define Print    printf
#endif // DEBUG
//-----------------------------------------------------------------------------
#define print_time printf( "%02lu:%02lu:%02lu ", ( time( 0 ) / 3600 ) % 24 + 2,\
    ( time( 0 ) / 60 ) % 60, time( 0 ) % 60 ); printf
//-----------------------------------------------------------------------------
#endif // L_CONSOLE_H
