/// @file w_console.h
/// @brief Работа с консолью в ОС Windows. Также другие безопасные функции 
/// работы со строками.
/// 
/// @author  Иванюк Дмитрий Сергеевич.
///
/// @par Описание директив препроцессора:
/// @c DEBUG    - компиляция c выводом отладочной информации в консоль.@n@n
/// 
/// @par Текущая версия:
/// @$Rev: 220 $.\n
/// @$Author: id $.\n
/// @$Date:: 2011-02-15 16:58:56#$.

#ifndef W_CONSOLE_H
#define W_CONSOLE_H

#pragma warning( disable : 4996 ) //strcpy and others unsafe functions

#include <time.h>
#include <conio.h>
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
#ifdef DEBUG
#undef Print
#define Print    printf
#endif // DEBUG
//-----------------------------------------------------------------------------
#define snprintf _snprintf
//-----------------------------------------------------------------------------
#define print_time printf( "--%02lu:%02lu:%02lu ", ( ( u_long ) time( 0 ) / 3600 ) \
    % 24, ( ( u_long ) time( 0 ) / 60 ) % 60, ( u_long ) time( 0 ) % 60 ); printf
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

#endif // W_CONSOLE_H
